import React from 'react'
import serviceBg from '../assets/form-section.png'
import girl from '../assets/girl.png'

export default function FormSection() {
  return (
    <section className='FormSection'>
      <div className="container">
        <div className="section-body">
          <img className='bg2' src={girl} alt="call center" />
          <img className='bg1' src={serviceBg} alt="bacground image" />
          <h2>ПОЛУЧИТЕ БЕСПЛАТНУЮ КОНСУЛЬТАЦИЮ И ОПЕРАТИВНУЮ ПОМОЩЬ</h2>
          <p>Свяжитесь со специалистом и получите консультацию по неисправности вашего котла.</p>
          <ul>
            <li>
              <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
                <path fill-rule="evenodd" clip-rule="evenodd" d="M18.3337 9.99984C18.3337 14.6022 14.6027 18.3332 10.0003 18.3332C5.39795 18.3332 1.66699 14.6022 1.66699 9.99984C1.66699 5.39746 5.39795 1.6665 10.0003 1.6665C14.6027 1.6665 18.3337 5.39746 18.3337 9.99984ZM13.3589 7.47456C13.603 7.71864 13.603 8.11437 13.3589 8.35842L9.19224 12.5251C8.94816 12.7692 8.55249 12.7692 8.30838 12.5251L6.64172 10.8584C6.39764 10.6143 6.39764 10.2187 6.64172 9.97459C6.88579 9.7305 7.28153 9.7305 7.5256 9.97459L8.75033 11.1993L10.6127 9.33692L12.4751 7.47456C12.7192 7.23049 13.1148 7.23049 13.3589 7.47456Z" fill="white"/>
              </svg>
              Получить консультацию по возникшей проблеме
            </li>

            <li>
              <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
                <path fill-rule="evenodd" clip-rule="evenodd" d="M18.3337 9.99984C18.3337 14.6022 14.6027 18.3332 10.0003 18.3332C5.39795 18.3332 1.66699 14.6022 1.66699 9.99984C1.66699 5.39746 5.39795 1.6665 10.0003 1.6665C14.6027 1.6665 18.3337 5.39746 18.3337 9.99984ZM13.3589 7.47456C13.603 7.71864 13.603 8.11437 13.3589 8.35842L9.19224 12.5251C8.94816 12.7692 8.55249 12.7692 8.30838 12.5251L6.64172 10.8584C6.39764 10.6143 6.39764 10.2187 6.64172 9.97459C6.88579 9.7305 7.28153 9.7305 7.5256 9.97459L8.75033 11.1993L10.6127 9.33692L12.4751 7.47456C12.7192 7.23049 13.1148 7.23049 13.3589 7.47456Z" fill="white"/>
              </svg>
              Уточнить стоимость услуг
            </li>

            <li>
              <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
                <path fill-rule="evenodd" clip-rule="evenodd" d="M18.3337 9.99984C18.3337 14.6022 14.6027 18.3332 10.0003 18.3332C5.39795 18.3332 1.66699 14.6022 1.66699 9.99984C1.66699 5.39746 5.39795 1.6665 10.0003 1.6665C14.6027 1.6665 18.3337 5.39746 18.3337 9.99984ZM13.3589 7.47456C13.603 7.71864 13.603 8.11437 13.3589 8.35842L9.19224 12.5251C8.94816 12.7692 8.55249 12.7692 8.30838 12.5251L6.64172 10.8584C6.39764 10.6143 6.39764 10.2187 6.64172 9.97459C6.88579 9.7305 7.28153 9.7305 7.5256 9.97459L8.75033 11.1993L10.6127 9.33692L12.4751 7.47456C12.7192 7.23049 13.1148 7.23049 13.3589 7.47456Z" fill="white"/>
              </svg>
              Оставить заявку на вызов мастера на дом
            </li>

            
          </ul>
          <form action="">
            <input type="text" placeholder='Ваш номер телефона' />
            <button>
              Отправить заявку
              <svg xmlns="http://www.w3.org/2000/svg" width="48" height="48" viewBox="0 0 48 48" fill="none">
                <rect x="0.5" y="0.5" width="47" height="47" rx="5.5" fill="white" stroke="#FFA800"/>
                <path d="M29.9683 19.7939C29.9683 19.2416 29.5206 18.7939 28.9683 18.7939L19.9683 18.7939C19.416 18.7939 18.9683 19.2416 18.9683 19.7939C18.9683 20.3462 19.416 20.7939 19.9683 20.7939L27.9683 20.7939L27.9683 28.7939C27.9683 29.3462 28.416 29.7939 28.9683 29.7939C29.5206 29.7939 29.9683 29.3462 29.9683 28.7939L29.9683 19.7939ZM19.8096 28.9526L20.5167 29.6597L29.6754 20.501L28.9683 19.7939L28.2612 19.0868L19.1025 28.2455L19.8096 28.9526Z" fill="#FFA800"/>
              </svg>
            </button>
            
          </form>
          <div className='section-bottom'>Отправляя заявку, вы соглашаетесь с условиями обработки ваших данных.</div>
        </div>
      </div>
    </section>
  )
}
