import React from 'react'
import p1 from '../assets/images/popular.png'

export default function PopularServices() {
  return (
    <section className='PopularServices'>
      <div className="container">
        <div className="section-title">
          <h5>Готовые сервисные решения</h5>
          <h2>САМЫЕ ВОСТРЕБОВАННЫЕ УСЛУГИ ДЛЯ КОНДИЦИОНЕРОВ</h2>
        </div>

        <div className='section-body'>
          <img src={p1} alt="katyol" />

          <div className='info-block'>
            <div>
              <h3>ПОЛНОЕ ОБСЛУЖИВАНИЕ КОНДИЦИОНЕРА</h3>
              <p>Проводим полную проверку кондиционера, выявляем причину неисправности и выполняем необходимые сервисные работы. В услугу входят диагностика, чистка, проверка фреона и настройка системы.</p>

              <h5>В услугу входит:</h5>
              <ul>
                <li>
                  <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M19 0H5.00002C2.23997 0.00332812 0.00332812 2.23997 0 5.00002V19C0.00332812 21.76 2.23997 23.9967 5.00002 24H19C21.76 23.9967 23.9967 21.76 24 19V5.00002C23.9967 2.23997 21.76 0.00332812 19 0ZM20 8.079L10.746 17.333C9.96511 18.1142 8.69878 18.1145 7.91756 17.3336C7.91738 17.3334 7.91719 17.3332 7.917 17.333L3.99998 13.417C3.60867 13.0257 3.60867 12.3913 3.99998 12C4.3913 11.6088 5.0257 11.6087 5.41697 12L9.33295 15.916L18.588 6.66202C18.9793 6.27211 19.6125 6.27323 20.0025 6.6645C20.3924 7.05581 20.3913 7.68909 20 8.079Z" fill="#30A0F6"/>
                  </svg>

                  Полная диагностика
                </li>

                <li>
                  <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M19 0H5.00002C2.23997 0.00332812 0.00332812 2.23997 0 5.00002V19C0.00332812 21.76 2.23997 23.9967 5.00002 24H19C21.76 23.9967 23.9967 21.76 24 19V5.00002C23.9967 2.23997 21.76 0.00332812 19 0ZM20 8.079L10.746 17.333C9.96511 18.1142 8.69878 18.1145 7.91756 17.3336C7.91738 17.3334 7.91719 17.3332 7.917 17.333L3.99998 13.417C3.60867 13.0257 3.60867 12.3913 3.99998 12C4.3913 11.6088 5.0257 11.6087 5.41697 12L9.33295 15.916L18.588 6.66202C18.9793 6.27211 19.6125 6.27323 20.0025 6.6645C20.3924 7.05581 20.3913 7.68909 20 8.079Z" fill="#30A0F6"/>
                  </svg>

                  Чистка внутреннего блока
                </li>

                <li>
                  <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M19 0H5.00002C2.23997 0.00332812 0.00332812 2.23997 0 5.00002V19C0.00332812 21.76 2.23997 23.9967 5.00002 24H19C21.76 23.9967 23.9967 21.76 24 19V5.00002C23.9967 2.23997 21.76 0.00332812 19 0ZM20 8.079L10.746 17.333C9.96511 18.1142 8.69878 18.1145 7.91756 17.3336C7.91738 17.3334 7.91719 17.3332 7.917 17.333L3.99998 13.417C3.60867 13.0257 3.60867 12.3913 3.99998 12C4.3913 11.6088 5.0257 11.6087 5.41697 12L9.33295 15.916L18.588 6.66202C18.9793 6.27211 19.6125 6.27323 20.0025 6.6645C20.3924 7.05581 20.3913 7.68909 20 8.079Z" fill="#30A0F6"/>
                  </svg>

                  Проверка давления фреона
                </li>

                <li>
                  <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M19 0H5.00002C2.23997 0.00332812 0.00332812 2.23997 0 5.00002V19C0.00332812 21.76 2.23997 23.9967 5.00002 24H19C21.76 23.9967 23.9967 21.76 24 19V5.00002C23.9967 2.23997 21.76 0.00332812 19 0ZM20 8.079L10.746 17.333C9.96511 18.1142 8.69878 18.1145 7.91756 17.3336C7.91738 17.3334 7.91719 17.3332 7.917 17.333L3.99998 13.417C3.60867 13.0257 3.60867 12.3913 3.99998 12C4.3913 11.6088 5.0257 11.6087 5.41697 12L9.33295 15.916L18.588 6.66202C18.9793 6.27211 19.6125 6.27323 20.0025 6.6645C20.3924 7.05581 20.3913 7.68909 20 8.079Z" fill="#30A0F6"/>
                  </svg>

                  Настройка и рекомендации
                </li>

              </ul>
            </div>
            <button>
              <span></span>
              Написать в Telegram
              <a href="https://t.me/Javlon_6767" target='_blank'>
                <svg xmlns="http://www.w3.org/2000/svg" width="48" height="48" viewBox="0 0 48 48" fill="none">
                <rect width="48" height="48" rx="6" fill="white"/>
                <path d="M29.9683 19.7939C29.9683 19.2416 29.5206 18.7939 28.9683 18.7939L19.9683 18.7939C19.416 18.7939 18.9683 19.2416 18.9683 19.7939C18.9683 20.3462 19.416 20.7939 19.9683 20.7939L27.9683 20.7939L27.9683 28.7939C27.9683 29.3462 28.416 29.7939 28.9683 29.7939C29.5206 29.7939 29.9683 29.3462 29.9683 28.7939L29.9683 19.7939ZM19.8096 28.9526L20.5167 29.6597L29.6754 20.501L28.9683 19.7939L28.2612 19.0868L19.1025 28.2455L19.8096 28.9526Z" fill="url(#paint0_linear_4055_405)"/>
                <path d="M29.9683 19.7939C29.9683 19.2416 29.5206 18.7939 28.9683 18.7939L19.9683 18.7939C19.416 18.7939 18.9683 19.2416 18.9683 19.7939C18.9683 20.3462 19.416 20.7939 19.9683 20.7939L27.9683 20.7939L27.9683 28.7939C27.9683 29.3462 28.416 29.7939 28.9683 29.7939C29.5206 29.7939 29.9683 29.3462 29.9683 28.7939L29.9683 19.7939ZM19.8096 28.9526L20.5167 29.6597L29.6754 20.501L28.9683 19.7939L28.2612 19.0868L19.1025 28.2455L19.8096 28.9526Z" fill="url(#paint1_linear_4055_405)"/>
                <defs>
                <linearGradient id="paint0_linear_4055_405" x1="24.3889" y1="24.3733" x2="25.096" y2="25.0804" gradientUnits="userSpaceOnUse">
                <stop stop-color="#FF752B"/>
                <stop offset="1" stop-color="#EF5B0C"/>
                </linearGradient>
                <linearGradient id="paint1_linear_4055_405" x1="24.3889" y1="24.3733" x2="25.096" y2="25.0804" gradientUnits="userSpaceOnUse">
                <stop stop-color="#30A0F6"/>
                <stop offset="1" stop-color="#177DE9"/>
                </linearGradient>
                </defs>
                </svg>
              </a>
            </button>
          </div>
        </div>
      </div>
    </section>
  )
}
